## Pandas

#### Pandas is a Python library for data analysis. It offers a number of data exploration, cleaning and transformation operations that are critical in working with data in Python.

## Series

In [2]:
import pandas as pd

In [3]:
grociries = pd.Series(data=[30, 9, 'Yes', 'No'], index=[
                      'eggs', 'apples', 'milk', 'bread'])
print(grociries)

eggs       30
apples      9
milk      Yes
bread      No
dtype: object

In [4]:
grociries.shape

(4,)

In [5]:
grociries.ndim

1

In [6]:
grociries.size

4

In [7]:
grociries.index

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [8]:
grociries.values

array([30, 9, 'Yes', 'No'], dtype=object)

In [9]:
'banana' in grociries

False

In [10]:
'bread' in grociries

True

## Accessing and Deleting Elements in Pandas Series

In [11]:
grociries['eggs']

30

In [12]:
grociries[['milk', 'bread']]

milk     Yes
bread     No
dtype: object

In [13]:
grociries[0]

30

In [14]:
grociries[-1]

'No'

In [15]:
grociries[[0, 1]]

eggs      30
apples     9
dtype: object

In [16]:
grociries.loc[['eggs', 'apples']]

eggs      30
apples     9
dtype: object

In [17]:
grociries.iloc[[0, 1]]

eggs      30
apples     9
dtype: object

In [18]:
grociries

eggs       30
apples      9
milk      Yes
bread      No
dtype: object

In [19]:
grociries['eggs'] = 2
grociries

eggs        2
apples      9
milk      Yes
bread      No
dtype: object

In [20]:
grociries.drop('apples')

eggs       2
milk     Yes
bread     No
dtype: object

In [21]:
grociries

eggs        2
apples      9
milk      Yes
bread      No
dtype: object

In [22]:
grociries.drop('apples', inplace=True)

In [23]:
grociries

eggs       2
milk     Yes
bread     No
dtype: object

## Arithmetic Operations on Pandas Series

In [24]:
fruits = pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])

In [25]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [26]:
fruits + 2

apples     12
oranges     8
bananas     5
dtype: int64

In [27]:
fruits - 2

apples     8
oranges    4
bananas    1
dtype: int64

In [28]:
fruits * 2

apples     20
oranges    12
bananas     6
dtype: int64

In [29]:
fruits / 2

apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [30]:
import numpy as np

In [31]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [32]:
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [33]:
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [34]:
np.power(fruits, 2)

apples     100
oranges     36
bananas      9
dtype: int64

In [35]:
fruits['bananas'] + 2

5

In [36]:
fruits['apples'] - 2

8

In [37]:
fruits.iloc[0] - 2

8

In [38]:
fruits[['apples', 'oranges']] * 2

apples     20
oranges    12
dtype: int64

In [39]:
fruits.loc[['apples', 'oranges']] / 2

apples     5.0
oranges    3.0
dtype: float64

In [40]:
grociries = pd.Series(data=[30, 9, 'Yes', 'No'], index=['eggs', 'apples', 'milk', 'bread'])

In [41]:
grociries * 2

eggs          60
apples        18
milk      YesYes
bread       NoNo
dtype: object

## DataFrame

In [42]:
items = {'Bob': pd.Series(data=[245, 25, 55], index=['bike', 'pants', 'watch']),
         'Alice': pd.Series(data=[40, 110, 500, 45], index=['book', 'glasses', 'bike', 'pants'])}
type(items)

dict

In [43]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [44]:
data = {'Bob': pd.Series(data=[245, 25, 55]),
        'Alice': pd.Series(data=[40, 110, 500, 45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [45]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [46]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [47]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [48]:
shopping_carts.shape

(5, 2)

In [49]:
shopping_carts.ndim

2

In [50]:
shopping_carts.size

10

In [51]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [52]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [53]:
alice_sel_shopping_cart = pd.DataFrame(items, index=['glasses', 'bike'], columns=['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [54]:
data = {'Integers': [1, 2, 3],
        'Floats': [4.5, 8.2, 9.6]}
df = pd.DataFrame(data, index=['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [55]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35},
            {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

store_items = pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

## Accessing elements in Pandas DataFrames

In [56]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [57]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [58]:
store_items.loc[['store 1']]

         bikes  pants  watches  glasses
store 1     20     30       35      NaN

In [59]:
store_items['bikes']['store 2']

15

In [60]:
store_items['shirts'] = [15, 2]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

In [61]:
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       2      7

In [62]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [63]:
store_items = pd.concat([store_items, new_store], sort=False)
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     2.0    7.0
store 3     20     30       35      4.0     NaN    NaN

In [64]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  suits  new_watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0     2.0    7.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0

In [65]:
store_items.insert(5, 'shoes', [8, 5, 0])
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits  new_watches
store 1     20     30       35      NaN    15.0      8   45.0          NaN
store 2     15      5       10     50.0     2.0      5    7.0         10.0
store 3     20     30       35      4.0     NaN      0    NaN         35.0

In [66]:
store_items.pop('new_watches')
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35      NaN    15.0      8   45.0
store 2     15      5       10     50.0     2.0      5    7.0
store 3     20     30       35      4.0     NaN      0    NaN

In [67]:
store_items = store_items.drop(['watches', 'shoes'], axis=1)
store_items

         bikes  pants  glasses  shirts  suits
store 1     20     30      NaN    15.0   45.0
store 2     15      5     50.0     2.0    7.0
store 3     20     30      4.0     NaN    NaN

In [68]:
store_items = store_items.drop(['store 1', 'store 2'], axis=0)
store_items

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

In [69]:
store_items = store_items.rename(columns={'bikes': 'hats'})
store_items

         hats  pants  glasses  shirts  suits
store 3    20     30      4.0     NaN    NaN

In [70]:
store_items = store_items.rename(index={'store 3': 'last store'})
store_items

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN

In [71]:
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

## Dealing with NaN

In [74]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shirts': 15, 'shoes': 8, 'suits': 45},
        {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5},
    {'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

store_items = pd.DataFrame(items, index=['store 1', 'store 2', 'store 3'])
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35        4    15.0    8.0   45.0
store 2     15      5       10       50     NaN    NaN    NaN
store 3     20     30       35        4     NaN    NaN    NaN

In [79]:
x = store_items.isnull().sum().sum()
x

6

In [80]:
store_items.count()

bikes      3
pants      3
watches    3
glasses    3
shirts     1
shoes      1
suits      1
dtype: int64

In [81]:
store_items.dropna(axis=0)

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35        4    15.0    8.0   45.0

In [82]:
store_items.dropna(axis=1)

         bikes  pants  watches  glasses
store 1     20     30       35        4
store 2     15      5       10       50
store 3     20     30       35        4

In [83]:
store_items.fillna(0)

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35        4    15.0    8.0   45.0
store 2     15      5       10       50     0.0    0.0    0.0
store 3     20     30       35        4     0.0    0.0    0.0

In [84]:
store_items.fillna(method='ffill', axis=0)

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35        4    15.0    8.0   45.0
store 2     15      5       10       50    15.0    8.0   45.0
store 3     20     30       35        4    15.0    8.0   45.0

In [85]:
store_items.fillna(method='ffill', axis=1)

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1   20.0   30.0     35.0      4.0    15.0    8.0   45.0
store 2   15.0    5.0     10.0     50.0    50.0   50.0   50.0
store 3   20.0   30.0     35.0      4.0     4.0    4.0    4.0

In [89]:
store_items.interpolate(method='linear', axis=0)

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35        4    15.0    8.0   45.0
store 2     15      5       10       50    15.0    8.0   45.0
store 3     20     30       35        4    15.0    8.0   45.0

In [90]:
store_items.interpolate(method='linear', axis=1)

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1   20.0   30.0     35.0      4.0    15.0    8.0   45.0
store 2   15.0    5.0     10.0     50.0    50.0   50.0   50.0
store 3   20.0   30.0     35.0      4.0     4.0    4.0    4.0

## Loading data into pandas DataFrame

In [93]:
google_stock = pd.read_csv('goog.csv')

In [95]:
print(type(google_stock))
print(google_stock.shape)

<class 'pandas.core.frame.DataFrame'>
(3313, 7)

In [97]:
google_stock

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,49.676899,51.693783,47.669952,49.845802,49.845802,44994500
1,2004-08-20,50.178635,54.187561,49.925285,53.805050,53.805050,23005800
2,2004-08-23,55.017166,56.373344,54.172661,54.346527,54.346527,18393200
3,2004-08-24,55.260582,55.439419,51.450363,52.096165,52.096165,15361800
4,2004-08-25,52.140873,53.651051,51.604362,52.657513,52.657513,9257400
...,...,...,...,...,...,...,...
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

In [99]:
google_stock.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [101]:
google_stock.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

In [105]:
google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [106]:
google_stock.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [107]:
google_stock['Adj Close'].describe()

count    3313.000000
mean      380.072458
std       223.853780
min        49.681866
25%       226.407440
50%       293.029114
75%       536.690002
max       989.679993
Name: Adj Close, dtype: float64

In [108]:
google_stock.max()

Date         2017-10-13
Open              992.0
High         997.210022
Low               989.0
Close        989.679993
Adj Close    989.679993
Volume         82768100
dtype: object

In [111]:
google_stock['Close'].mean()

380.07245805795355

In [114]:
google_stock.min()

Date         2004-08-19
Open          49.274517
High          50.541279
Low           47.669952
Close         49.681866
Adj Close     49.681866
Volume             7900
dtype: object

In [118]:
data = pd.read_csv('fake-company.csv')

In [119]:
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [123]:
data.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [125]:
data.groupby(['Year'])['Salary'].mean()

Year
1990    51000.0
1991    54000.0
1992    58000.0
Name: Salary, dtype: float64

In [126]:
data.groupby(['Name'])['Salary'].sum()

Name
Alice      50000
Bob        48000
Charlie    55000
Dakota     52000
Elsa       50000
Frank      60000
Grace      60000
Hoffman    52000
Inaar      62000
Name: Salary, dtype: int64

In [127]:
data.groupby(['Department', 'Year'])['Salary'].sum()

Department  Year
Admin       1990     55000
            1991     60000
            1992    122000
HR          1990     50000
            1991     52000
RD          1990     48000
            1991     50000
            1992     52000
Name: Salary, dtype: int64